valentinasp/temperatureboard-stm32f303/hw_config.c
/******************** (C) COPYRIGHT 2009 STMicroelectronics ********************
* File Name          : hw_config.c
* Author             : MCD Application Team
* Version            : V3.1.0
* Date               : 10/30/2009
* Description        : Hardware Configuration & Setup
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32f30x_it.h"
#include "hw_config.h"
#include <string.h>

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
ErrorStatus HSEStartUpStatus;
//int32_t DevTicks = 0;
#if 0
/* Output Port parameters */
GPIO_TypeDef * OUTP_PORT[PORT_OUTP_N] = {
                                  PORT_OUTP_00_PORT, PORT_OUTP_01_PORT, PORT_OUTP_02_PORT, PORT_OUTP_03_PORT,
                                  PORT_OUTP_04_PORT, PORT_OUTP_05_PORT, PORT_OUTP_06_PORT, PORT_OUTP_07_PORT,
                                  PORT_OUTP_08_PORT, PORT_OUTP_09_PORT, PORT_OUTP_10_PORT,                               
};
const uint16_t OUTP_PIN[PORT_OUTP_N] = {
                                  PORT_OUTP_00_PIN, PORT_OUTP_01_PIN, PORT_OUTP_02_PIN, PORT_OUTP_03_PIN,
                                  PORT_OUTP_04_PIN, PORT_OUTP_05_PIN, PORT_OUTP_06_PIN, PORT_OUTP_07_PIN,
                                  PORT_OUTP_08_PIN, PORT_OUTP_09_PIN, PORT_OUTP_10_PIN,                                 
};
const uint32_t OUTP_CLK[PORT_OUTP_N] = {
                                  PORT_OUTP_00_CLK, PORT_OUTP_01_CLK, PORT_OUTP_02_CLK, PORT_OUTP_03_CLK,
                                  PORT_OUTP_04_CLK, PORT_OUTP_05_CLK, PORT_OUTP_06_CLK, PORT_OUTP_07_CLK,
                                  PORT_OUTP_08_CLK, PORT_OUTP_09_CLK, PORT_OUTP_10_CLK,                                 
};
const GPIOMode_TypeDef OUTP_MODE[PORT_OUTP_N] = {
                                  PORT_OUTP_00_MODE, PORT_OUTP_01_MODE, PORT_OUTP_02_MODE, PORT_OUTP_03_MODE,
                                  PORT_OUTP_04_MODE, PORT_OUTP_05_MODE, PORT_OUTP_06_MODE, PORT_OUTP_07_MODE,
                                  PORT_OUTP_08_MODE, PORT_OUTP_09_MODE, PORT_OUTP_10_MODE,                                 
};
const GPIOSpeed_TypeDef OUTP_SPEED[PORT_OUTP_N] = {
                                  PORT_OUTP_00_SPEED, PORT_OUTP_01_SPEED, PORT_OUTP_02_SPEED, PORT_OUTP_03_SPEED,
                                  PORT_OUTP_04_SPEED, PORT_OUTP_05_SPEED, PORT_OUTP_06_SPEED, PORT_OUTP_07_SPEED,
                                  PORT_OUTP_08_SPEED, PORT_OUTP_09_SPEED, PORT_OUTP_10_SPEED,
};
const BitAction OUTP_DEFAULT_VAL[PORT_OUTP_N] = {
                                  PORT_OUTP_00_DEFAULT_VAL, PORT_OUTP_01_DEFAULT_VAL, PORT_OUTP_02_DEFAULT_VAL, PORT_OUTP_03_DEFAULT_VAL,
                                  PORT_OUTP_04_DEFAULT_VAL, PORT_OUTP_05_DEFAULT_VAL, PORT_OUTP_06_DEFAULT_VAL, PORT_OUTP_07_DEFAULT_VAL,
                                  PORT_OUTP_08_DEFAULT_VAL, PORT_OUTP_09_DEFAULT_VAL, PORT_OUTP_10_DEFAULT_VAL,                                
};

/* Input Port parameters */
GPIO_TypeDef * INP_PORT[PORT_INP_N] = {
                                  PORT_INP_00_PORT, PORT_INP_01_PORT, PORT_INP_02_PORT, PORT_INP_03_PORT,
                                  PORT_INP_04_PORT, PORT_INP_05_PORT, PORT_INP_06_PORT,
};
const uint16_t INP_PIN[PORT_INP_N] = {
                                  PORT_INP_00_PIN, PORT_INP_01_PIN, PORT_INP_02_PIN, PORT_INP_03_PIN,  
                                  PORT_INP_04_PIN, PORT_INP_05_PIN, PORT_INP_06_PIN,                                     
};
const uint32_t INP_CLK[PORT_INP_N] = {
                                  PORT_INP_00_CLK, PORT_INP_01_CLK, PORT_INP_02_CLK, PORT_INP_03_CLK,
                                  PORT_INP_04_CLK, PORT_INP_05_CLK, PORT_INP_06_CLK,                                   
};
const GPIOMode_TypeDef INP_MODE[PORT_INP_N] = {
                                  PORT_INP_00_MODE, PORT_INP_01_MODE, PORT_INP_02_MODE, PORT_INP_03_MODE,
                                  PORT_INP_04_MODE, PORT_INP_05_MODE, PORT_INP_06_MODE,                                   
};


/* COM Port parameters */
USART_TypeDef* COM_USART[COM_N] = {PORT_COM1, PORT_COM2}; 
GPIO_TypeDef* COM_PORT[COM_N] = {PORT_COM1_GPIO, PORT_COM2_GPIO};
const uint32_t COM_USART_CLK[COM_N] = {PORT_COM1_CLK, PORT_COM2_CLK};
const uint32_t COM_PORT_CLK[COM_N] = {PORT_COM1_GPIO_CLK, PORT_COM2_GPIO_CLK};
const uint16_t COM_TX_PIN[COM_N] = {PORT_COM1_TxPin, PORT_COM2_TxPin};
const uint16_t COM_RX_PIN[COM_N] = {PORT_COM1_RxPin, PORT_COM2_RxPin};



/* Private function prototypes -----------------------------------------------*/
#ifdef __GNUC__
/* With GCC/RAISONANCE, small printf (option LD Linker->Libraries->Small printf
   set to 'Yes') calls __io_putchar() */
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#else
#ifdef CFG_USE_RUNTIME_PRINTF
#define PUTCHAR_PROTOTYPE int fputc(int ch, FILE *f)
#endif /* CFG_USE_RUNTIME_PRINTF */
#endif /* __GNUC__ */

/* Extern variables ----------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
void Set_System_Init();
void Set_System(void);
void RTC_Configuration(void);
void NVIC_Configuration(void);
void SysTick_Configuration(void);
void PVD_Configuration(void);
void RCC_Configuration(void);
void GPIO_Configuration(void);
void EXTI_Configuration(void);
void IWDG_Configuration(void);
void BOARD_OUTPInit(OUTP_TypeDef OUTport);
void BOARD_OUTPOn(OUTP_TypeDef OUTport);
void BOARD_OUTPOff(OUTP_TypeDef OUTport);
void BOARD_OUTPToggle(OUTP_TypeDef OUTport);
void BOARD_INPInit(INP_TypeDef INport);
uint32_t BOARD_INPReadBit(INP_TypeDef INport);
uint8_t BOARD_INPGetFlag(INP_TypeDef INport);
void BOARD_COMInit(COM_TypeDef COM, USART_InitTypeDef* USART_InitStruct);
void BOARD_COM_PutChar(COM_TypeDef COM, uint8_t ch);
uint8_t BOARD_COM_GetChar(COM_TypeDef COM);
void BOARD_COM_PutStr(COM_TypeDef COM, const uint8_t *str);
void BOARD_COM_Printf(const char *str);
//PUTCHAR_PROTOTYPE
void Printf_Configuration();
void PowerOn_Check();
void BOARD_Power_Off();

/* Private functions ---------------------------------------------------------*/

void Set_System_Init()
{
  BOARD_INPInit(INP_BUT_ONOFF);
  BOARD_OUTPInit(OUTP_PWRSHDN);     
}

