valentinasp/temperatureboard-stm32f303/hw_config.c
/*******************************************************************************
* Function Name  : Set_System
* Description    : Configures Main system clocks & power
* Input          : None.
* Return         : None.
*******************************************************************************/
void Set_System(void)
{
  /* RCC configuration */
  RCC_Configuration();

  GPIO_Configuration();
  SysTick_Configuration();
  EXTI_Configuration();
  NVIC_Configuration();
  
  RTC_Configuration();
  
  #ifndef DEBUG
    IWDG_Configuration();
  #endif
}


/**
  * @brief  Configures RTC clock source and prescaler.
  * @param  None
  * @retval None
  */
void RTC_Configuration(void)
{ 
   /* Enable PWR and BKP clocks */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);

  /* Allow access to BKP Domain */
  PWR_BackupAccessCmd(ENABLE);

  /* Reset Backup Domain */
  BKP_DeInit();

  /* Enable the LSI OSC */
  RCC_LSICmd(ENABLE);
  /* Wait till LSI is ready */
  while (RCC_GetFlagStatus(RCC_FLAG_LSIRDY) == RESET)
  {}
  /* Select the RTC Clock Source */
  RCC_RTCCLKConfig(RCC_RTCCLKSource_LSI);

  /* Enable RTC Clock */
  RCC_RTCCLKCmd(ENABLE);

  /* Wait for RTC registers synchronization */
  RTC_WaitForSynchro();

  /* Wait until last write operation on RTC registers has finished */
  RTC_WaitForLastTask();

  /* Enable the RTC Second */
  RTC_ITConfig(RTC_IT_ALR, ENABLE);

  /* Wait until last write operation on RTC registers has finished */
  RTC_WaitForLastTask();

  /* Set RTC prescaler: set RTC period to 1sec */
  RTC_SetPrescaler(32768);

  /* Wait until last write operation on RTC registers has finished */
  RTC_WaitForLastTask();
}

/**
  * @brief  Configures NVIC and Vector Table base location.
  * @param  None
  * @retval : None
  */
void NVIC_Configuration(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;
  
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;  
  
  /* OMAP Ready signal */  
  NVIC_InitStructure.NVIC_IRQChannel = EXTI15_10_IRQn;  
  NVIC_Init(&NVIC_InitStructure);    
  
  /* PWR but signal */  
  NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQn;  
  NVIC_Init(&NVIC_InitStructure);  

  /* VFL but signal */  
  NVIC_InitStructure.NVIC_IRQChannel = EXTI3_IRQn;  
  NVIC_Init(&NVIC_InitStructure);    
  
  NVIC_InitStructure.NVIC_IRQChannel = RTCAlarm_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);  
  
  /* Set the Vector Table base location at 0x08000000 */ 
  //NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0000);
  
  /* Configure one bit for preemption priority */
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_3); 
}

void NVIC_Control_Button_Int(FunctionalState state)
{
  EXTI_InitTypeDef EXTI_InitStructure;

  /* Configure Button EXTI line */
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;  
  EXTI_InitStructure.EXTI_LineCmd = state; 
  
  /* Connect Button EXTI Line to pwr but */
  GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, GPIO_PinSource2);
  EXTI_InitStructure.EXTI_Line = EXTI_Line2;  
  EXTI_Init(&EXTI_InitStructure);
  
  /* Connect Button EXTI Line to vfl but */
  GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, GPIO_PinSource3);
  EXTI_InitStructure.EXTI_Line = EXTI_Line3;  
  EXTI_Init(&EXTI_InitStructure);

  /* Connect Button EXTI Line to omap ready but */
  GPIO_EXTILineConfig(GPIO_PortSourceGPIOB, GPIO_PinSource12);
  EXTI_InitStructure.EXTI_Line = EXTI_Line12; 
  EXTI_Init(&EXTI_InitStructure);
}

void NVIC_Control_Charger_Int(FunctionalState state)
{
  EXTI_InitTypeDef EXTI_InitStructure;

  /* Configure EXTI line */
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;  
  EXTI_InitStructure.EXTI_LineCmd = state; 
  
  /* Connect EXTI Line to  VC_CHARGING */
  GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, GPIO_PinSource5);
  EXTI_InitStructure.EXTI_Line = EXTI_Line5;  
  EXTI_Init(&EXTI_InitStructure);
  
  /* Connect EXTI Line to  VC_CHARGER_ON */
  GPIO_EXTILineConfig(GPIO_PortSourceGPIOA, GPIO_PinSource6);
  EXTI_InitStructure.EXTI_Line = EXTI_Line6;  
  EXTI_Init(&EXTI_InitStructure);
}
/**
* @brief  Configures the SysTick to generate an interrupt each 250 ms.
* @param  None
* @retval None
*/
void SysTick_Configuration(void)
{
  uint32_t enc;
  DevTicks = 0;
    /* SysTick interrupt each 10 ms with SysTick Clock equal to 8/8 MHz */
    if(SysTick_Config((8000000/8) / 1000))
    { 
      /* Capture error */ 
      while (1);
    }

  /* Select AHB clock(HCLK) divided by 8 as SysTick clock source */
  SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);

  /* Encode the priority for an interrupt */
  /* group = 3, priority=2, subpriority=1 */
  enc = NVIC_EncodePriority(3, 0, 0);

  /* Set SysTick Preemption Priority */
  NVIC_SetPriority(SysTick_IRQn, enc);
}

 
void PVD_Configuration(void)
{
 
  NVIC_InitTypeDef NVIC_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;  
  
  /* Enable PWR and BKP clock */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);  

  /* Set the Vector Table base location at 0x08000000 */ 
  //NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x0000);
  
  /* Configure one bit for preemption priority */
  NVIC_PriorityGroupConfig(NVIC_PriorityGroup_3);

  /* Configure EXTI Line16(PVD Output) to generate an interrupt on rising and
  falling edges */
  EXTI_ClearITPendingBit(EXTI_Line16);
  EXTI_InitStructure.EXTI_Line = EXTI_Line16;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);  
  
    /* Enable the PVD Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = PVD_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure); 
   
