valentinasp/temperatureboard-stm32f303/hw_config.c
#endif /* HSI_PLL_ON */
 
#ifdef HSI_PLL_OFF
  
  /* Disable Prefetch Buffer */
  FLASH_PrefetchBufferCmd(FLASH_PrefetchBuffer_Disable);
  
  /* Flash 0 wait state */
  FLASH_SetLatency(FLASH_Latency_0);
  
  #ifdef HSI_PLL_OFF_8MHz
  /* HCLK = SYSCLK */
  RCC_HCLKConfig(RCC_SYSCLK_Div1); 
  #endif 

  #ifdef HSI_PLL_OFF_4MHz
  /* HCLK = SYSCLK/2 = 4MHz */
  RCC_HCLKConfig(RCC_SYSCLK_Div2); 
  #endif 
    
  #ifdef HSI_PLL_OFF_2MHz
  /* HCLK = SYSCLK/4 = 2MHz */
  RCC_HCLKConfig(RCC_SYSCLK_Div4); 
  #endif 
    
  #ifdef HSI_PLL_OFF_1MHz
  /* HCLK = SYSCLK/8 = 1MHz */
  RCC_HCLKConfig(RCC_SYSCLK_Div8); 
  #endif 
   
  #ifdef HSI_PLL_OFF_500KHz
  /* HCLK = SYSCLK/16 = 500KHz */
  RCC_HCLKConfig(RCC_SYSCLK_Div16); 
  #endif 
    
  #ifdef HSI_PLL_OFF_125KHz
  /* HCLK = SYSCLK/64 = 125KHz */
  RCC_HCLKConfig(RCC_SYSCLK_Div64); 
  #endif 
    
  /* PCLK2 = HCLK/2 */
  RCC_PCLK2Config(RCC_HCLK_Div2); 

  /* PCLK1 = HCLK/2 */
  RCC_PCLK1Config(RCC_HCLK_Div2);
  
  /* Select HSI as system clock source */
  RCC_SYSCLKConfig(RCC_SYSCLKSource_HSI);

  /* Wait till HSI is used as system clock source */
   while(RCC_GetSYSCLKSource() != 0x00)
  {
  }    
#endif /* HSI_PLL_OFF */ 
}

/**
  * @brief  Configures the different GPIO ports.
  * @param  None
  * @retval : None
  */
void GPIO_Configuration(void)
{ 
  /* Initialize Output Port pins */
  BOARD_OUTPInit(OUTP_MAIN_ON);    
  BOARD_OUTPInit(OUTP_OMAP_ON);  
  BOARD_OUTPInit(OUTP_VFL_ON);   
  BOARD_OUTPInit(OUTP_BL_CTRL);     
  BOARD_OUTPInit(OUTP_BL_ON);       
  BOARD_OUTPInit(OUTP_OMAP_RSTn); 
  BOARD_OUTPInit(OUTP_OMAP_IN0); 
  BOARD_OUTPInit(OUTP_OMAP_IN1); 
  BOARD_OUTPInit(OUTP_OMAP_IN2);    
  BOARD_OUTPInit(OUTP_LED);    
  
  /* Initialize Input Port pins */  
  BOARD_INPInit(INP_OMAP_READY);         
  BOARD_INPInit(INP_OMAP_OUT0);         
  BOARD_INPInit(INP_OMAP_OUT1);           
}


/**
  * @brief  Configures EXTI Lines.
  * @param  None
  * @retval : None
  */
void EXTI_Configuration(void)
{
  EXTI_InitTypeDef EXTI_InitStructure;
  
  /* Configure EXTI Line17(RTC Alarm) to generate an interrupt on rising edge */
  EXTI_ClearITPendingBit(EXTI_Line17);
  EXTI_InitStructure.EXTI_Line = EXTI_Line17;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);
}

/**
  * @brief  Configures IWDG watchdog.
  * @param  None
  * @retval : None
  */
void IWDG_Configuration(void)
{
  /* IWDG timeout equal to sec (the timeout may varies due to LSI frequency dispersion) */
  /* Enable write access to IWDG_PR and IWDG_RLR registers */
  IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);

  /* IWDG counter clock: 40KHz(LSI) / 256 = 156.25 Hz */
  IWDG_SetPrescaler(IWDG_Prescaler_256);

  /* Set counter reload value to max ~26 s */
  IWDG_SetReload(0xFFF);

  /* Reload IWDG counter */
  IWDG_ReloadCounter();

  /* Enable IWDG (the LSI oscillator will be enabled by hardware) */
  IWDG_Enable();
}

/**
  * @brief  Configures Output Port GPIO.
  * @param  OUTport: Specifies the Port to be configured. 
  *   This parameter can be one of following parameters:
  *     @arg OUTP_xxx
  * @retval None
  */
void BOARD_OUTPInit(OUTP_TypeDef OUTport)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  
  /* Enable the GPIO Clock */
  RCC_APB2PeriphClockCmd(OUTP_CLK[OUTport], ENABLE);

  /* Write default pin value */
  GPIO_WriteBit(OUTP_PORT[OUTport], OUTP_PIN[OUTport], OUTP_DEFAULT_VAL[OUTport]);

  /* Configure the GPIO pin */
  GPIO_InitStructure.GPIO_Pin = OUTP_PIN[OUTport];
  GPIO_InitStructure.GPIO_Mode = OUTP_MODE[OUTport]; 
  GPIO_InitStructure.GPIO_Speed = OUTP_SPEED[OUTport];

  GPIO_Init(OUTP_PORT[OUTport], &GPIO_InitStructure);
}

/**
  * @brief  Turns selected Port On.
  * @param  OUTport: Specifies the Port to be used. 
  *   This parameter can be one of following parameters:
  *     @arg OUTP_xxx
  * @retval None
  */
void BOARD_OUTPOn(OUTP_TypeDef OUTport)
{
  OUTP_PORT[OUTport]->BSRR = OUTP_PIN[OUTport]; 
}

/**
  * @brief  Turns selected Port Off.
  * @param  OUTport: Specifies the Port to be used. 
  *   This parameter can be one of following parameters:
  *     @arg OUTP_xxx
  * @retval None
  */
void BOARD_OUTPOff(OUTP_TypeDef OUTport)
{
  OUTP_PORT[OUTport]->BRR = OUTP_PIN[OUTport];
}

/**
  * @brief  Toggles the selected Port.
  * @param  OUTport: Specifies the Port to be used. 
  *   This parameter can be one of following parameters:
  *     @arg OUTP_xxx
  * @retval None
  */
void BOARD_OUTPToggle(OUTP_TypeDef OUTport)
{
  OUTP_PORT[OUTport]->ODR ^= OUTP_PIN[OUTport];
}

/**
  * @brief  Configures Button GPIO.
  * @param  INport: Specifies the Port to be configured.
  *   This parameter can be one of following parameters:
  *     @arg INP_xxx
  * @retval None
  */
void BOARD_INPInit(INP_TypeDef INport)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable Button GPIO clock */
  RCC_APB2PeriphClockCmd(INP_CLK[INport], ENABLE);
  
  /* Configure Button pin as input floating */
  GPIO_InitStructure.GPIO_Pin = INP_PIN[INport];
  GPIO_InitStructure.GPIO_Mode = INP_MODE[INport];
  GPIO_Init(INP_PORT[INport], &GPIO_InitStructure);
}

/**
  * @brief  Reads the specified input port pin.
  * @param  INport: Specifies the Port to be used.
  *   This parameter can be one of following parameters:
  *     @arg INP_xxx
  * @retval The GPIO pin value.
  */
uint32_t BOARD_INPReadBit(INP_TypeDef INport)
{
  return (INP_PORT[INport]->IDR & INP_PIN[INport]);
}

/**
  * @brief  Returns the selected Pin flag set or not.
  * @param  INport: Specifies the Port to be used.
  *   This parameter can be one of following parameters:
  *     @arg INP_xxx
  * @retval The Button GPIO pin flag (SET or RESET).
  */
uint8_t BOARD_INPGetFlag(INP_TypeDef INport)
{
  FlagStatus bitstatus;
  if(INP_PORT[INport]->IDR & INP_PIN[INport])
  {
    bitstatus = SET;
  }else{
    bitstatus = RESET;
  }
  /* Return the flag status */
  return bitstatus;
}

