valentinasp/temperatureboard-stm32f303/hw_config.c
#if 0
/**
  * @brief  Configures COM port.
  * @param  COM: Specifies the COM port to be configured.
  *   This parameter can be one of following parameters:    
  *     @arg COM1
  *     @arg COM2  
  * @param  USART_InitStruct: pointer to a USART_InitTypeDef structure that
  *   contains the configuration information for the specified USART peripheral.
  * @retval None
  */
void BOARD_COMInit(COM_TypeDef COM, USART_InitTypeDef* USART_InitStruct)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /* Enable GPIO clock */
  RCC_APB2PeriphClockCmd(COM_PORT_CLK[COM] | RCC_APB2Periph_AFIO, ENABLE);

  /* Enable UART clock */
  if (COM == COM1)
  {
    RCC_APB2PeriphClockCmd(COM_USART_CLK[COM], ENABLE); 
  }
  else
  {
    RCC_APB1PeriphClockCmd(COM_USART_CLK[COM], ENABLE);
  }

  /* Configure USART Tx as alternate function push-pull */
  GPIO_InitStructure.GPIO_Pin = COM_TX_PIN[COM];
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
  GPIO_Init(COM_PORT[COM], &GPIO_InitStructure);
    
  /* Configure USART Rx as input floating */
  GPIO_InitStructure.GPIO_Pin = COM_RX_PIN[COM];
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(COM_PORT[COM], &GPIO_InitStructure);

  /* Reset USART */
  USART_DeInit(COM_USART[COM]);

  /* USART configuration */
  USART_Init(COM_USART[COM], USART_InitStruct);
    
  /* Enable USART */
  USART_Cmd(COM_USART[COM], ENABLE);
}


/**
  * @brief  Put char to the COM Port.
  * @param  COM: Specifies the COM port to be configured.
  *   This parameter can be one of following parameters:    
  *     @arg COM1
  *     @arg COM2  
  * @param  ch: character
  * @retval None
  */
void BOARD_COM_PutChar(COM_TypeDef COM, uint8_t ch)
{
  /* Write a character to the USART */
  USART_SendData(COM_USART[COM], ch);

  /* Loop until the end of transmission */
  while (USART_GetFlagStatus(COM_USART[COM], USART_FLAG_TC) == RESET){}
}


/**
  * @brief  Get char from the COM Port.
  * @param  COM: Specifies the COM port to be configured.
  *   This parameter can be one of following parameters:    
  *     @arg COM1
  *     @arg COM2  
  * @retval character
  */
uint8_t BOARD_COM_GetChar(COM_TypeDef COM)
{
  uint8_t ch;

  /* Loop until RXNE = 1 */
  while(USART_GetFlagStatus(COM_USART[COM], USART_FLAG_RXNE) == RESET){}
  ch = (USART_ReceiveData(COM_USART[COM]));
  
  return ch;
}


/**
  * @brief  Put string to the COM Port.
  * @param  COM: Specifies the COM port to be configured.
  *   This parameter can be one of following parameters:    
  *     @arg COM1
  *     @arg COM2  
  * @param  str: string
  * @retval None
  */
void BOARD_COM_PutStr(COM_TypeDef COM, const uint8_t *str)
{
  while(*str){
    BOARD_COM_PutChar(COM, *str++);
  }
}

/**
  * @brief  Put string to the standart output.
  * @param  str: string
  * @retval None
  */
void BOARD_COM_Printf(const char *str)
{
  while(*str){
    BOARD_COM_PutChar(COM1, *str++);
  }
}
#endif

/**
  * @brief  Retargets the C library printf function to the USART.
  * @param  None
  * @retval None
  */
#ifdef CFG_USE_RUNTIME_PRINTF
PUTCHAR_PROTOTYPE
{
  /* Place your implementation of fputc here */
  /* e.g. write a character to the USART */
  USART_SendData(PORT_COM1, (uint8_t) ch);

  /* Loop until the end of transmission */
  while (USART_GetFlagStatus(PORT_COM1, USART_FLAG_TC) == RESET){}
  
  return ch;
}
#endif /* CFG_USE_RUNTIME_PRINTF */

/**
  * @brief  Configures USART for C library printf function.
  * @param  None
  * @retval None
  */
void Printf_Configuration()
{
  USART_InitTypeDef USART_InitStructure;
  /* USART1 configuration ------------------------------------------------------*/
  /* USART1 configured as follow:
        - BaudRate = 115200 baud  
        - Word Length = 8 Bits
        - One Stop Bit
        - No parity
        - Hardware flow control disabled (RTS and CTS signals)
        - Receive and transmit enabled
        - USART Clock disabled
        - USART CPOL: Clock is active low
        - USART CPHA: Data is captured on the middle 
        - USART LastBit: The clock pulse of the last data bit is not output to 
                         the SCLK pin
  */
  USART_InitStructure.USART_BaudRate = 115200;
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  BOARD_COMInit(COM1, &USART_InitStructure);

  /* Wait until transmiter ready */
  while (USART_GetFlagStatus(PORT_COM1, USART_FLAG_TC) == RESET){}
}

void PowerOn_Check()
{
  int i;
  long j;
  
  // check if not battery low
  //if (BOARD_INPReadBit(INP_LOBAT)){
  if (1){
    // check ON/Off held at least 5 * 100 ms = 0.5 sec
    for(i = 0; i < 5; i++){
      if (!BOARD_INPGetFlag(INP_BUT_ONOFF)){
        BOARD_OUTPOn(OUTP_PWRSHDN); // turn off
      }      
      //for(j=0; j < 250000; j++); // ~100 msec delay
      for(j=0; j < 130000; j++); // ~100 msec delay
    }
  }
  else{
    BOARD_OUTPOn(OUTP_PWRSHDN); // turn off
  }
}

void BOARD_Power_Off()
{ 
  BOARD_OUTPOn(OUTP_PWRSHDN); // turn off
}

#endif
